# SQL 

The goal is to learn how to connect to a SQL database through Python interface. The SQL dialect of choice for this lesson is Sqlite.

In [1]:
! which sqlite3

/Users/carlostavarez/opt/anaconda3/bin/sqlite3

In [2]:
# install sqlalchemy with conda
import sys

## Connect to a Database

To access SQL database in Python we will use the [SQLAlchemy](https://docs.sqlalchemy.org/en/13/intro.html) library. SQLAlchemy also works with MySQL and PostgreSQL. The argument `create_engine` specifies the SQL dialect and the pool to be used. Here, our dialect is Sqlite and our pool is *class_db*. More information about `create_engine` is found [here](https://docs.sqlalchemy.org/en/13/core/engines.html#sqlite). The `inspect` element let us see the configuration and construction of in-memory objects.

In [3]:
# install SQLAlchemt using pip
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /Users/carlostavarez/opt/anaconda3/lib/python3.7/site-packages (1.3.9)

In [4]:
import sqlalchemy
from sqlalchemy import create_engine
from sqlalchemy import inspect

### On Disk

To save the database on disk you just need to change the pool from *in-memory* to the relative working directory.

In [5]:
# The database will be saved to disk
db_name_disk = 'sqlite:///class_db'


# create an enginer
engine_disk = create_engine(db_name_disk, echo=True)


# print('\n', sqlalchemy.__version__, '\n')
print('\n', engine_disk)

 Engine(sqlite:///class_db)

## Create a Table

### On Disk

To create a table we will pass the statement of create table with the description of each column. Here our table is named `students`, which contains the name, college, year, and group project number of each student in the class.

In [6]:
# drop table if table already exists
drop_table_statement = """drop table if exists students"""
engine_disk.execute(drop_table_statement)

# sql statement
create_table_statement = """create table students(
    id integer primary key,
    name text not null,
    college text not null,
    year text not null,
    group_project integer not null
);
"""

engine_disk.execute(create_table_statement)

2020-03-12 20:19:30,096 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2020-03-12 20:19:30,097 INFO sqlalchemy.engine.base.Engine ()
2020-03-12 20:19:30,098 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2020-03-12 20:19:30,099 INFO sqlalchemy.engine.base.Engine ()
2020-03-12 20:19:30,100 INFO sqlalchemy.engine.base.Engine drop table if exists students
2020-03-12 20:19:30,101 INFO sqlalchemy.engine.base.Engine ()
2020-03-12 20:19:30,103 INFO sqlalchemy.engine.base.Engine COMMIT
2020-03-12 20:19:30,104 INFO sqlalchemy.engine.base.Engine create table students(
    id integer primary key,
    name text not null,
    college text not null,
    year text not null,
    group_project integer not null
);

2020-03-12 20:19:30,104 INFO sqlalchemy.engine.base.Engine ()
2020-03-12 20:19:30,106 INFO sqlalchemy.engine.base.Engine COMMIT

## Inspecting the Database and tables

In [7]:
# get the names of all tables in the database
engine_disk.table_names()

2020-03-12 20:20:27,554 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2020-03-12 20:20:27,555 INFO sqlalchemy.engine.base.Engine ()

['ml_projects', 'students']

In [8]:
# inspect the database
inspect(engine_disk).get_table_names()

2020-03-12 20:20:45,825 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2020-03-12 20:20:45,825 INFO sqlalchemy.engine.base.Engine ()

['ml_projects', 'students']

In [9]:
# get column information

for col in inspect(engine_disk).get_columns('students'):
    print(col)

2020-03-12 20:21:13,043 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("students")
2020-03-12 20:21:13,044 INFO sqlalchemy.engine.base.Engine ()
{'name': 'id', 'type': INTEGER(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 1}
{'name': 'name', 'type': TEXT(), 'nullable': False, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}
{'name': 'college', 'type': TEXT(), 'nullable': False, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}
{'name': 'year', 'type': TEXT(), 'nullable': False, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}
{'name': 'group_project', 'type': INTEGER(), 'nullable': False, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}

### Feeding Data to Database

#### From a list of tuples

To feed data into the database we can iterate over an array of tuples where the value of each element inside of the tuple agrees to the condtions specified to each column of such table. For example, the code below inserts the information of the Intro to Data Science from the Star Wars characters class.

In [11]:
people_list = [
    ('Han Solo', 'ccny', 'junior', 1),
    ('Darth Vader', 'bcny', 'senior', 2),
    ('Yoda', 'qcny', 'senior', 3),
    ('ObiWan Kenobi', 'sicny', 'senior', 4),
    ('Prinncess Leia', 'lcny', 'sophomore', 1),
    ('Luke Skywalker', 'hcny', 'sophomore', 3),
    ('Rey', 'ycny', 'freshmane', 3),
    ('Darth Maul', 'lcny', 'senior', 2),
    ('Lando Calrissian', 'bcny', 'junior', 4),
    ('Chewbacca', 'qcny', 'junior', 1),
    ('Finn', 'sicny', 'freshman', 4),
    ('Kylo Ren', 'ccny', 'junior', 2)
]

insert_statement = """
insert into students (name, college, year, group_project)
    values(?, ?, ?, ?)
"""

for row in people_list:
    print('\n', f"inserting {row[0]}")
    
    # insert into db
    engine_disk.execute(insert_statement, *row)

 inserting Han Solo
2020-03-12 20:23:43,637 INFO sqlalchemy.engine.base.Engine
insert into students (name, college, year, group_project)
    values(?, ?, ?, ?)

2020-03-12 20:23:43,638 INFO sqlalchemy.engine.base.Engine ('Han Solo', 'ccny', 'junior', 1)
2020-03-12 20:23:43,639 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Darth Vader
2020-03-12 20:23:43,641 INFO sqlalchemy.engine.base.Engine
insert into students (name, college, year, group_project)
    values(?, ?, ?, ?)

2020-03-12 20:23:43,641 INFO sqlalchemy.engine.base.Engine ('Darth Vader', 'bcny', 'senior', 2)
2020-03-12 20:23:43,643 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Yoda
2020-03-12 20:23:43,645 INFO sqlalchemy.engine.base.Engine
insert into students (name, college, year, group_project)
    values(?, ?, ?, ?)

2020-03-12 20:23:43,645 INFO sqlalchemy.engine.base.Engine ('Yoda', 'qcny', 'senior', 3)
2020-03-12 20:23:43,646 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting ObiWan Kenobi
2020-03-12 20:23:43,648 INFO sqlalchemy.engine.base.Engine
insert into students (name, college, year, group_project)
    values(?, ?, ?, ?)

2020-03-12 20:23:43,648 INFO sqlalchemy.engine.base.Engine ('ObiWan Kenobi', 'sicny', 'senior', 4)
2020-03-12 20:23:43,649 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Prinncess Leia
2020-03-12 20:23:43,650 INFO sqlalchemy.engine.base.Engine
insert into students (name, college, year, group_project)
    values(?, ?, ?, ?)

2020-03-12 20:23:43,651 INFO sqlalchemy.engine.base.Engine ('Prinncess Leia', 'lcny', 'sophomore', 1)
2020-03-12 20:23:43,652 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Luke Skywalker
2020-03-12 20:23:43,653 INFO sqlalchemy.engine.base.Engine
insert into students (name, college, year, group_project)
    values(?, ?, ?, ?)

2020-03-12 20:23:43,654 INFO sqlalchemy.engine.base.Engine ('Luke Skywalker', 'hcny', 'sophomore', 3)
2020-03-12 20:23:43,655 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Rey
2020-03-12 20:23:43,656 INFO sqlalchemy.engine.base.Engine
insert into students (name, college, year, group_project)
    values(?, ?, ?, ?)

2020-03-12 20:23:43,657 INFO sqlalchemy.engine.base.Engine ('Rey', 'ycny', 'freshmane', 3)
2020-03-12 20:23:43,658 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Darth Maul
2020-03-12 20:23:43,659 INFO sqlalchemy.engine.base.Engine
insert into students (name, college, year, group_project)
    values(?, ?, ?, ?)

2020-03-12 20:23:43,660 INFO sqlalchemy.engine.base.Engine ('Darth Maul', 'lcny', 'senior', 2)
2020-03-12 20:23:43,661 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Lando Calrissian
2020-03-12 20:23:43,663 INFO sqlalchemy.engine.base.Engine
insert into students (name, college, year, group_project)
    values(?, ?, ?, ?)

2020-03-12 20:23:43,663 INFO sqlalchemy.engine.base.Engine ('Lando Calrissian', 'bcny', 'junior', 4)
2020-03-12 20:23:43,665 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Chewbacca
2020-03-12 20:23:43,666 INFO sqlalchemy.engine.base.Engine
insert into students (name, college, year, group_project)
    values(?, ?, ?, ?)

2020-03-12 20:23:43,666 INFO sqlalchemy.engine.base.Engine ('Chewbacca', 'qcny', 'junior', 1)
2020-03-12 20:23:43,667 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Finn
2020-03-12 20:23:43,670 INFO sqlalchemy.engine.base.Engine
insert into students (name, college, year, group_project)
    values(?, ?, ?, ?)

2020-03-12 20:23:43,670 INFO sqlalchemy.engine.base.Engine ('Finn', 'sicny', 'freshman', 4)
2020-03-12 20:23:43,671 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Kylo Ren
2020-03-12 20:23:43,673 INFO sqlalchemy.engine.base.Engine
insert into students (name, college, year, group_project)
    values(?, ?, ?, ?)

2020-03-12 20:23:43,673 INFO sqlalchemy.engine.base.Engine ('Kylo Ren', 'ccny', 'junior', 2)
2020-03-12 20:23:43,674 INFO sqlalchemy.engine.base.Engine COMMIT

#### From a Pandas Data Frame

Pandas Data Frames can be fed to a database by the `to_sql` method and connecting to the engine. The next example creates a table for the type of machine learning each group will use for their project.

In [12]:
# Pandas library
import pandas as pd

In [13]:
projects_list = [
    ('Supervised', 1),
    ('Unsupervised', 2),
    ('Clustering', 3),
    ('Data reduction', 4)
]

In [14]:
df = pd.DataFrame(projects_list, columns=['ml_type', 'group_project'])

In [15]:
df

          ml_type  group_project
0      Supervised              1
1    Unsupervised              2
2      Clustering              3
3  Data reduction              4

In [19]:
# drop table if table already exists
drop_table_statement = """drop table if exists ml_projects"""
engine_disk.execute(drop_table_statement)

2020-03-12 20:28:06,697 INFO sqlalchemy.engine.base.Engine drop table if exists ml_projects
2020-03-12 20:28:06,697 INFO sqlalchemy.engine.base.Engine ()
2020-03-12 20:28:06,699 INFO sqlalchemy.engine.base.Engine COMMIT

In [20]:
engine_disk.table_names()

2020-03-12 20:28:07,766 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2020-03-12 20:28:07,767 INFO sqlalchemy.engine.base.Engine ()

['students']

In [21]:
# create a new table in our database from the data frame
df.to_sql('ml_projects', con=engine_disk)

2020-03-12 20:28:12,712 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("ml_projects")
2020-03-12 20:28:12,713 INFO sqlalchemy.engine.base.Engine ()
2020-03-12 20:28:12,714 INFO sqlalchemy.engine.base.Engine PRAGMA temp.table_info("ml_projects")
2020-03-12 20:28:12,715 INFO sqlalchemy.engine.base.Engine ()
2020-03-12 20:28:12,717 INFO sqlalchemy.engine.base.Engine
CREATE TABLE ml_projects (
	"index" BIGINT,
	ml_type TEXT,
	group_project BIGINT
)


2020-03-12 20:28:12,718 INFO sqlalchemy.engine.base.Engine ()
2020-03-12 20:28:12,719 INFO sqlalchemy.engine.base.Engine COMMIT
2020-03-12 20:28:12,720 INFO sqlalchemy.engine.base.Engine CREATE INDEX ix_ml_projects_index ON ml_projects ("index")
2020-03-12 20:28:12,720 INFO sqlalchemy.engine.base.Engine ()
2020-03-12 20:28:12,722 INFO sqlalchemy.engine.base.Engine COMMIT
2020-03-12 20:28:12,724 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-03-12 20:28:12,725 INFO sqlalchemy.engine.base.Engine INSERT INTO ml_projects ("index", ml_type, group_project) VALUES (?, ?, ?)
2020-03-12 20:28:12,726 INFO sqlalchemy.engine.base.Engine ((0, 'Supervised', 1), (1, 'Unsupervised', 2), (2, 'Clustering', 3), (3, 'Data reduction', 4))
2020-03-12 20:28:12,727 INFO sqlalchemy.engine.base.Engine COMMIT

In [22]:
engine_disk.table_names()

2020-03-12 20:28:16,314 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2020-03-12 20:28:16,314 INFO sqlalchemy.engine.base.Engine ()

['ml_projects', 'students']

In [23]:
select_statement = """select * from ml_projects"""

select_table = engine_disk.execute(select_statement)

for row in select_table:
    print('\n',dict(row))

2020-03-12 20:28:36,351 INFO sqlalchemy.engine.base.Engine select * from ml_projects
2020-03-12 20:28:36,351 INFO sqlalchemy.engine.base.Engine ()

 {'index': 0, 'ml_type': 'Supervised', 'group_project': 1}

 {'index': 1, 'ml_type': 'Unsupervised', 'group_project': 2}

 {'index': 2, 'ml_type': 'Clustering', 'group_project': 3}

 {'index': 3, 'ml_type': 'Data reduction', 'group_project': 4}

In [24]:
select_statement = """select * from ml_projects"""

select_table = engine_disk.execute(select_statement)

for row in select_table:
    print('\n',row)

2020-03-12 20:28:59,623 INFO sqlalchemy.engine.base.Engine select * from ml_projects
2020-03-12 20:28:59,624 INFO sqlalchemy.engine.base.Engine ()

 (0, 'Supervised', 1)

 (1, 'Unsupervised', 2)

 (2, 'Clustering', 3)

 (3, 'Data reduction', 4)

### Retrieve Selected Rows

In [25]:
# selection for numbers
select_statement = """select * from students where group_project = 1"""

select_table = engine_disk.execute(select_statement)

2020-03-12 20:29:30,301 INFO sqlalchemy.engine.base.Engine select * from students where group_project = 1
2020-03-12 20:29:30,302 INFO sqlalchemy.engine.base.Engine ()

In [26]:
# print out selection
for row in select_table:
    print(dict(row))

{'id': 1, 'name': 'Han Solo', 'college': 'ccny', 'year': 'junior', 'group_project': 1}
{'id': 5, 'name': 'Prinncess Leia', 'college': 'lcny', 'year': 'sophomore', 'group_project': 1}
{'id': 10, 'name': 'Chewbacca', 'college': 'qcny', 'year': 'junior', 'group_project': 1}

In [27]:
# new selection for strings
select_statement2 = """select * from students where year <> 'senior'"""

select_table2 = engine_disk.execute(select_statement2)

2020-03-12 20:29:51,620 INFO sqlalchemy.engine.base.Engine select * from students where year <> 'senior'
2020-03-12 20:29:51,621 INFO sqlalchemy.engine.base.Engine ()

In [28]:
# print out new selection
for row in select_table2:
    print(row)

(1, 'Han Solo', 'ccny', 'junior', 1)
(5, 'Prinncess Leia', 'lcny', 'sophomore', 1)
(6, 'Luke Skywalker', 'hcny', 'sophomore', 3)
(7, 'Rey', 'ycny', 'freshmane', 3)
(9, 'Lando Calrissian', 'bcny', 'junior', 4)
(10, 'Chewbacca', 'qcny', 'junior', 1)
(11, 'Finn', 'sicny', 'freshman', 4)
(12, 'Kylo Ren', 'ccny', 'junior', 2)

### Update Selected Rows

In [29]:
new_select = engine_disk.execute("""
                                    select name, college, group_project 
                                    from students 
                                    where name = 'Finn'""")

2020-03-12 20:30:25,273 INFO sqlalchemy.engine.base.Engine
                                    select name, college, group_project
                                    from students
                                    where name = 'Finn'
2020-03-12 20:30:25,273 INFO sqlalchemy.engine.base.Engine ()

In [30]:
# print out updated info
for row in new_select:
    print(dict(row))

{'name': 'Finn', 'college': 'sicny', 'group_project': 4}

In [31]:
update_statement = """
update students
set college = ?
where name = ?
"""

engine_disk.execute(update_statement, 'ccny', 'Finn')

2020-03-12 20:31:34,040 INFO sqlalchemy.engine.base.Engine
update students
set college = ?
where name = ?

2020-03-12 20:31:34,041 INFO sqlalchemy.engine.base.Engine ('ccny', 'Finn')
2020-03-12 20:31:34,041 INFO sqlalchemy.engine.base.Engine COMMIT

In [32]:
# get info after being updated
new_select = engine_disk.execute("""select name, college, group_project from students where name = 'Finn'""")

2020-03-12 20:31:44,745 INFO sqlalchemy.engine.base.Engine select name, college, group_project from students where name = 'Finn'
2020-03-12 20:31:44,746 INFO sqlalchemy.engine.base.Engine ()

In [33]:
# print out updated info
for row in new_select:
    print(dict(row))

{'name': 'Finn', 'college': 'ccny', 'group_project': 4}

## Joining Tables

In [34]:
new_select = engine_disk.execute('select * from ml_projects')

for row in new_select:
    print(dict(row))

2020-03-12 20:32:21,085 INFO sqlalchemy.engine.base.Engine select * from ml_projects
2020-03-12 20:32:21,086 INFO sqlalchemy.engine.base.Engine ()
{'index': 0, 'ml_type': 'Supervised', 'group_project': 1}
{'index': 1, 'ml_type': 'Unsupervised', 'group_project': 2}
{'index': 2, 'ml_type': 'Clustering', 'group_project': 3}
{'index': 3, 'ml_type': 'Data reduction', 'group_project': 4}

In [35]:
statement_join = """
create table students_ml as
select name, college, year, ml_type from students
inner join ml_projects
on ml_projects.group_project = students.group_project;
"""

In [36]:
new_select = engine_disk.execute(statement_join)

2020-03-12 20:33:19,483 INFO sqlalchemy.engine.base.Engine
create table students_ml as
select name, college, year, ml_type from students
inner join ml_projects
on ml_projects.group_project = students.group_project;

2020-03-12 20:33:19,484 INFO sqlalchemy.engine.base.Engine ()
2020-03-12 20:33:19,486 INFO sqlalchemy.engine.base.Engine COMMIT

In [37]:
engine_disk.table_names()

2020-03-12 20:33:24,244 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2020-03-12 20:33:24,245 INFO sqlalchemy.engine.base.Engine ()

['ml_projects', 'students', 'students_ml']

In [38]:
engine_disk.execute('select * from students_ml').fetchall()

2020-03-12 20:34:07,881 INFO sqlalchemy.engine.base.Engine select * from students_ml
2020-03-12 20:34:07,882 INFO sqlalchemy.engine.base.Engine ()

[('Han Solo', 'ccny', 'junior', 'Supervised'),
 ('Darth Vader', 'bcny', 'senior', 'Unsupervised'),
 ('Yoda', 'qcny', 'senior', 'Clustering'),
 ('ObiWan Kenobi', 'sicny', 'senior', 'Data reduction'),
 ('Prinncess Leia', 'lcny', 'sophomore', 'Supervised'),
 ('Luke Skywalker', 'hcny', 'sophomore', 'Clustering'),
 ('Rey', 'ycny', 'freshmane', 'Clustering'),
 ('Darth Maul', 'lcny', 'senior', 'Unsupervised'),
 ('Lando Calrissian', 'bcny', 'junior', 'Data reduction'),
 ('Chewbacca', 'qcny', 'junior', 'Supervised'),
 ('Finn', 'ccny', 'freshman', 'Data reduction'),
 ('Kylo Ren', 'ccny', 'junior', 'Unsupervised')]

## SQL table to Pandas Data Frame

In [39]:
df_sql = pd.read_sql('select * from students_ml', engine_disk)

2020-03-12 20:34:50,899 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("select * from students_ml")
2020-03-12 20:34:50,899 INFO sqlalchemy.engine.base.Engine ()
2020-03-12 20:34:50,900 INFO sqlalchemy.engine.base.Engine PRAGMA temp.table_info("select * from students_ml")
2020-03-12 20:34:50,900 INFO sqlalchemy.engine.base.Engine ()
2020-03-12 20:34:50,902 INFO sqlalchemy.engine.base.Engine select * from students_ml
2020-03-12 20:34:50,902 INFO sqlalchemy.engine.base.Engine ()

In [40]:
df_sql

                name college       year         ml_type
0           Han Solo    ccny     junior      Supervised
1        Darth Vader    bcny     senior    Unsupervised
2               Yoda    qcny     senior      Clustering
3      ObiWan Kenobi   sicny     senior  Data reduction
4     Prinncess Leia    lcny  sophomore      Supervised
5     Luke Skywalker    hcny  sophomore      Clustering
6                Rey    ycny  freshmane      Clustering
7         Darth Maul    lcny     senior    Unsupervised
8   Lando Calrissian    bcny     junior  Data reduction
9          Chewbacca    qcny     junior      Supervised
10              Finn    ccny   freshman  Data reduction
11          Kylo Ren    ccny     junior    Unsupervised

# SQL Exercise

## Database and Table Information

In [41]:
# Database information

# your code goes here
engine_disk.table_names()

2020-03-12 20:55:03,044 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2020-03-12 20:55:03,045 INFO sqlalchemy.engine.base.Engine ()

['ml_projects', 'students', 'students_ml']

In [34]:
# Database information
# Answer

2020-03-09 10:42:42,387 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2020-03-09 10:42:42,387 INFO sqlalchemy.engine.base.Engine ()

['ml_projects', 'students', 'students_ml']

In [43]:
# get column information for ml_projects

# your code goes here

for col in inspect(engine_disk).get_columns('ml_projects'):
    print(col)

2020-03-12 20:56:19,882 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("ml_projects")
2020-03-12 20:56:19,883 INFO sqlalchemy.engine.base.Engine ()
{'name': 'index', 'type': BIGINT(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}
{'name': 'ml_type', 'type': TEXT(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}
{'name': 'group_project', 'type': BIGINT(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}

In [45]:
help(inspect)

Help on function inspect in module sqlalchemy.inspection:

inspect(subject, raiseerr=True)
    Produce an inspection object for the given target.

    The returned value in some cases may be the
    same object as the one given, such as if a
    :class:`.Mapper` object is passed.   In other
    cases, it will be an instance of the registered
    inspection type for the given object, such as
    if an :class:`.engine.Engine` is passed, an
    :class:`.Inspector` object is returned.

    :param subject: the subject to be inspected.
    :param raiseerr: When ``True``, if the given subject
     does not
     correspond to a known SQLAlchemy inspected type,
     :class:`sqlalchemy.exc.NoInspectionAvailable`
     is raised.  If ``False``, ``None`` is returned.

In [35]:
# get column information for ml_projects

# Answer

2020-03-09 10:42:42,394 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("ml_projects")
2020-03-09 10:42:42,394 INFO sqlalchemy.engine.base.Engine ()
{'name': 'index', 'type': BIGINT(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}
{'name': 'ml_type', 'type': TEXT(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}
{'name': 'group_project', 'type': BIGINT(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}

## Create a Table

In this exercise you will create a table named students_script to store the name and favorite scripting langaubge of each student. In other worlds, the students_script table must have three columns: id, name, and script.

In [ ]:
# sql statement, your sql code goes here
create_table_statement = """
.............
.............
"""

In [ ]:
# drop table if table already exists
drop_table_statement = """drop table if exists students_script"""
engine_disk.execute(drop_table_statement)



engine_disk.execute(create_table_statement)

In [36]:
# Final answer

2020-03-09 10:42:42,400 INFO sqlalchemy.engine.base.Engine drop table if exists students_script
2020-03-09 10:42:42,401 INFO sqlalchemy.engine.base.Engine ()
2020-03-09 10:42:42,401 INFO sqlalchemy.engine.base.Engine COMMIT
2020-03-09 10:42:42,402 INFO sqlalchemy.engine.base.Engine create table students_script(
    id integer primary key,
    name text not null,
    script text not null
);

2020-03-09 10:42:42,403 INFO sqlalchemy.engine.base.Engine ()
2020-03-09 10:42:42,405 INFO sqlalchemy.engine.base.Engine COMMIT

## Explore the Database

In [ ]:
# Database information

# your code goes here

In [37]:
# Database information

# Answer

2020-03-09 10:42:42,410 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2020-03-09 10:42:42,411 INFO sqlalchemy.engine.base.Engine ()

['ml_projects', 'students', 'students_ml', 'students_script']

In [ ]:
# Table information

# your code goes here

In [38]:
# Table information

# Answer

2020-03-09 10:42:42,417 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("students_script")
2020-03-09 10:42:42,418 INFO sqlalchemy.engine.base.Engine ()
{'name': 'id', 'type': INTEGER(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 1}
{'name': 'name', 'type': TEXT(), 'nullable': False, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}
{'name': 'script', 'type': TEXT(), 'nullable': False, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}

## Feed the new Table

In [39]:
# new list of tuples
people_list = [
    ('Han Solo', 'C++'),
    ('Darth Vader', 'C'),
    ('Yoda', 'C'),
    ('ObiWan Kenobi', 'C'),
    ('Prinncess Leia', 'Java'),
    ('Luke Skywalker', 'Java'),
    ('Rey', 'Python'),
    ('Darth Maul', 'JavaScript'),
    ('Lando Calrissian', 'C++'),
    ('Chewbacca', 'C++'),
    ('Finn', 'Python'),
    ('Kylo Ren', 'JavaScript')
]

In [ ]:
# your code goes here

insert_statement = """
.........
....
"""

for row in people_list:
    print('\n', f"inserting {row[0]}")
    
    # insert into db
    engine_disk.execute(insert_statement, *row)

In [40]:
# Final Answer

 inserting Han Solo
2020-03-09 10:42:42,429 INFO sqlalchemy.engine.base.Engine
insert into students_script (name, script)
    values(?, ?)

2020-03-09 10:42:42,429 INFO sqlalchemy.engine.base.Engine ('Han Solo', 'C++')
2020-03-09 10:42:42,430 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Darth Vader
2020-03-09 10:42:42,432 INFO sqlalchemy.engine.base.Engine
insert into students_script (name, script)
    values(?, ?)

2020-03-09 10:42:42,432 INFO sqlalchemy.engine.base.Engine ('Darth Vader', 'C')
2020-03-09 10:42:42,433 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Yoda
2020-03-09 10:42:42,434 INFO sqlalchemy.engine.base.Engine
insert into students_script (name, script)
    values(?, ?)

2020-03-09 10:42:42,434 INFO sqlalchemy.engine.base.Engine ('Yoda', 'C')
2020-03-09 10:42:42,435 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting ObiWan Kenobi
2020-03-09 10:42:42,437 INFO sqlalchemy.engine.base.Engine
insert into students_script (name, script)
    values(?, ?)

2020-03-09 10:42:42,437 INFO sqlalchemy.engine.base.Engine ('ObiWan Kenobi', 'C')
2020-03-09 10:42:42,438 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Prinncess Leia
2020-03-09 10:42:42,440 INFO sqlalchemy.engine.base.Engine
insert into students_script (name, script)
    values(?, ?)

2020-03-09 10:42:42,440 INFO sqlalchemy.engine.base.Engine ('Prinncess Leia', 'Java')
2020-03-09 10:42:42,441 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Luke Skywalker
2020-03-09 10:42:42,442 INFO sqlalchemy.engine.base.Engine
insert into students_script (name, script)
    values(?, ?)

2020-03-09 10:42:42,443 INFO sqlalchemy.engine.base.Engine ('Luke Skywalker', 'Java')
2020-03-09 10:42:42,443 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Rey
2020-03-09 10:42:42,445 INFO sqlalchemy.engine.base.Engine
insert into students_script (name, script)
    values(?, ?)

2020-03-09 10:42:42,445 INFO sqlalchemy.engine.base.Engine ('Rey', 'Python')
2020-03-09 10:42:42,446 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Darth Maul
2020-03-09 10:42:42,447 INFO sqlalchemy.engine.base.Engine
insert into students_script (name, script)
    values(?, ?)

2020-03-09 10:42:42,448 INFO sqlalchemy.engine.base.Engine ('Darth Maul', 'JavaScript')
2020-03-09 10:42:42,449 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Lando Calrissian
2020-03-09 10:42:42,450 INFO sqlalchemy.engine.base.Engine
insert into students_script (name, script)
    values(?, ?)

2020-03-09 10:42:42,450 INFO sqlalchemy.engine.base.Engine ('Lando Calrissian', 'C++')
2020-03-09 10:42:42,451 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Chewbacca
2020-03-09 10:42:42,453 INFO sqlalchemy.engine.base.Engine
insert into students_script (name, script)
    values(?, ?)

2020-03-09 10:42:42,453 INFO sqlalchemy.engine.base.Engine ('Chewbacca', 'C++')
2020-03-09 10:42:42,454 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Finn
2020-03-09 10:42:42,455 INFO sqlalchemy.engine.base.Engine
insert into students_script (name, script)
    values(?, ?)

2020-03-09 10:42:42,456 INFO sqlalchemy.engine.base.Engine ('Finn', 'Python')
2020-03-09 10:42:42,457 INFO sqlalchemy.engine.base.Engine COMMIT

 inserting Kylo Ren
2020-03-09 10:42:42,459 INFO sqlalchemy.engine.base.Engine
insert into students_script (name, script)
    values(?, ?)

2020-03-09 10:42:42,459 INFO sqlalchemy.engine.base.Engine ('Kylo Ren', 'JavaScript')
2020-03-09 10:42:42,460 INFO sqlalchemy.engine.base.Engine COMMIT

## Join Tables

In this exercise you will join the new table you just created to `students_ml` table by the students name.

In [41]:
# your sql statement goes here
statement_join = """
.........
.........
"""

In [ ]:
# run the script
engine_disk.execute(statement_join).fetchall()

In [42]:
# Final Answer

2020-03-09 10:42:42,473 INFO sqlalchemy.engine.base.Engine
select * from students_ml
natural join students_script

2020-03-09 10:42:42,474 INFO sqlalchemy.engine.base.Engine ()

[('Han Solo', 'ccny', 'junior', 'Supervised', 1, 'C++'),
 ('Darth Vader', 'bcny', 'senior', 'Unsupervised', 2, 'C'),
 ('Yoda', 'qcny', 'senior', 'Clustering', 3, 'C'),
 ('ObiWan Kenobi', 'sicny', 'senior', 'Data reduction', 4, 'C'),
 ('Prinncess Leia', 'lcny', 'sophomore', 'Supervised', 5, 'Java'),
 ('Luke Skywalker', 'hcny', 'sophomore', 'Clustering', 6, 'Java'),
 ('Rey', 'ycny', 'freshmane', 'Clustering', 7, 'Python'),
 ('Darth Maul', 'lcny', 'senior', 'Unsupervised', 8, 'JavaScript'),
 ('Lando Calrissian', 'bcny', 'junior', 'Data reduction', 9, 'C++'),
 ('Chewbacca', 'qcny', 'junior', 'Supervised', 10, 'C++'),
 ('Finn', 'ccny', 'freshman', 'Data reduction', 11, 'Python'),
 ('Kylo Ren', 'ccny', 'junior', 'Unsupervised', 12, 'JavaScript')]

## To Pandas Data Frame

In [ ]:
# create a pandas data frame of the join statement above

In [43]:
# Answer when tables are joined

2020-03-09 10:42:42,481 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("
select * from students_ml
natural join students_script
")
2020-03-09 10:42:42,482 INFO sqlalchemy.engine.base.Engine ()
2020-03-09 10:42:42,482 INFO sqlalchemy.engine.base.Engine PRAGMA temp.table_info("
select * from students_ml
natural join students_script
")
2020-03-09 10:42:42,483 INFO sqlalchemy.engine.base.Engine ()
2020-03-09 10:42:42,484 INFO sqlalchemy.engine.base.Engine
select * from students_ml
natural join students_script

2020-03-09 10:42:42,485 INFO sqlalchemy.engine.base.Engine ()

In [ ]:
# print the new data frame

In [44]:
# Data Frame answer

                name college       year         ml_type  id      script
0           Han Solo    ccny     junior      Supervised   1         C++
1        Darth Vader    bcny     senior    Unsupervised   2           C
2               Yoda    qcny     senior      Clustering   3           C
3      ObiWan Kenobi   sicny     senior  Data reduction   4           C
4     Prinncess Leia    lcny  sophomore      Supervised   5        Java
5     Luke Skywalker    hcny  sophomore      Clustering   6        Java
6                Rey    ycny  freshmane      Clustering   7      Python
7         Darth Maul    lcny     senior    Unsupervised   8  JavaScript
8   Lando Calrissian    bcny     junior  Data reduction   9         C++
9          Chewbacca    qcny     junior      Supervised  10         C++
10              Finn    ccny   freshman  Data reduction  11      Python
11          Kylo Ren    ccny     junior    Unsupervised  12  JavaScript

In [45]:
# drop the `id` column and print the data frame

In [46]:
# final answer

                name college       year         ml_type      script
0           Han Solo    ccny     junior      Supervised         C++
1        Darth Vader    bcny     senior    Unsupervised           C
2               Yoda    qcny     senior      Clustering           C
3      ObiWan Kenobi   sicny     senior  Data reduction           C
4     Prinncess Leia    lcny  sophomore      Supervised        Java
5     Luke Skywalker    hcny  sophomore      Clustering        Java
6                Rey    ycny  freshmane      Clustering      Python
7         Darth Maul    lcny     senior    Unsupervised  JavaScript
8   Lando Calrissian    bcny     junior  Data reduction         C++
9          Chewbacca    qcny     junior      Supervised         C++
10              Finn    ccny   freshman  Data reduction      Python
11          Kylo Ren    ccny     junior    Unsupervised  JavaScript